[
  {
    "mission": "RetiD1",
    "nome": "a",
    "cognome": "a",
    "classe": "a",
    "voto": 0.25,
    "dataorainizio": "2025-04-29T21:30:55.135Z",
    "inizio": "29/04/2025, 23:30:55",
    "durata": 30003,
    "giuste": 2,
    "sbagliate": 0,
    "quiz": [
      {
        "id": 50,
        "domanda": "Qual è un concetto chiave nella progettazione di reti resilienti?",
        "svg": " ✅ Ridondanza"
      },
      {
        "id": 10,
        "domanda": "Qual è il primo passo fondamentale nel processo di troubleshooting di una rete?",
        "svg": " ✅ Identificare il problema e raccogliere informazioni"
      },
      {
        "id": 31,
        "domanda": "Qual è la funzione principale di un <a href=\"md.html?file=firewall.md\" target=\"_blank\">firewall stateful</a>?",
        "svg": ""
      },
      {
        "id": 14,
        "domanda": "Qual è il significato dell'acronimo RAID?",
        "svg": ""
      },
      {
        "id": 19,
        "domanda": "Qual è un tipo comune di attacco informatico?",
        "svg": ""
      },
      {
        "id": 37,
        "domanda": "Qual è la funzione principale di un server DNS secondario?",
        "svg": ""
      },
      {
        "id": 41,
        "domanda": "Qual è la funzione principale di un hypervisor in un ambiente virtualizzato?",
        "svg": ""
      },
      {
        "id": 7,
        "domanda": "Qual è una funzionalità tipica di un firewall?",
        "svg": ""
      },
      {
        "id": 2,
        "domanda": "Qual è un vantaggio principale dell'utilizzo di una rete locale (LAN)?",
        "svg": ""
      },
      {
        "id": 24,
        "domanda": "Qual è lo scopo principale del protocollo SNMP (Simple Network Management Protocol)?",
        "svg": ""
      },
      {
        "id": 46,
        "domanda": "Qual è un aspetto importante da considerare nella gestione delle password degli utenti?",
        "svg": ""
      },
      {
        "id": 35,
        "domanda": "Qual è la funzione principale del protocollo SNMP trap?",
        "svg": ""
      },
      {
        "id": 33,
        "domanda": "Qual è la funzione principale di un sistema SIEM (Security Information and Event Management)?",
        "svg": ""
      },
      {
        "id": 3,
        "domanda": "Quale dei seguenti è un modello di servizio del Cloud Computing?",
        "svg": ""
      },
      {
        "id": 21,
        "domanda": "Qual è la differenza tra un indirizzo IP pubblico e uno privato?",
        "svg": ""
      },
      {
        "id": 26,
        "domanda": "Qual è la funzione principale di un load balancer?",
        "svg": ""
      },
      {
        "id": 25,
        "domanda": "Qual è un metodo per migliorare la tolleranza ai guasti in un sistema informatico?",
        "svg": ""
      },
      {
        "id": 43,
        "domanda": "Qual è la funzione principale di un certificato digitale?",
        "svg": ""
      },
      {
        "id": 22,
        "domanda": "Qual è la funzione principale di una VLAN (Virtual Local Area Network)?",
        "svg": ""
      },
      {
        "id": 12,
        "domanda": "Qual è la differenza fondamentale tra un hub e uno switch?",
        "svg": ""
      },
      {
        "id": 38,
        "domanda": "Qual è un attacco informatico volto a rendere un servizio non disponibile agli utenti legittimi?",
        "svg": ""
      },
      {
        "id": 44,
        "domanda": "Qual è un metodo per proteggere le comunicazioni web?",
        "svg": ""
      },
      {
        "id": 45,
        "domanda": "Qual è la funzione principale di un sistema di prevenzione delle intrusioni (Intrusion Prevention System - IPS)?",
        "svg": ""
      },
      {
        "id": 36,
        "domanda": "Qual è un tipo di architettura di rete comune in ambienti aziendali?",
        "svg": ""
      },
      {
        "id": 23,
        "domanda": "Qual è un protocollo utilizzato per la gestione remota di server e dispositivi di rete tramite una linea di comando sicura?",
        "svg": ""
      },
      {
        "id": 18,
        "domanda": "Qual è lo scopo principale di un sistema IDS (Intrusion Detection System)?",
        "svg": ""
      },
      {
        "id": 49,
        "domanda": "Qual è la funzione principale di un sistema di patch management?",
        "svg": ""
      },
      {
        "id": 27,
        "domanda": "Qual è un tipo di cavo comunemente utilizzato nelle reti Ethernet?",
        "svg": ""
      },
      {
        "id": 15,
        "domanda": "Qual è lo scopo principale di un sistema di backup?",
        "svg": ""
      },
      {
        "id": 16,
        "domanda": "Qual è la funzione principale di un router in una rete?",
        "svg": ""
      },
      {
        "id": 4,
        "domanda": "Qual è un principio fondamentale per garantire la sicurezza di una rete informatica?",
        "svg": ""
      },
      {
        "id": 17,
        "domanda": "Qual è un metodo comune per autenticare gli utenti su una rete?",
        "svg": ""
      },
      {
        "id": 8,
        "domanda": "Quale dei seguenti è un protocollo utilizzato per implementare una VPN (Virtual Private Network)?",
        "svg": ""
      },
      {
        "id": 5,
        "domanda": "Qual è un vantaggio principale della segmentazione di una rete in sottoreti?",
        "svg": ""
      },
      {
        "id": 48,
        "domanda": "Qual è un modo per migliorare le prestazioni di una rete?",
        "svg": ""
      },
      {
        "id": 29,
        "domanda": "Qual è un modo per proteggere una rete wireless?",
        "svg": ""
      },
      {
        "id": 34,
        "domanda": "Qual è un metodo per garantire la disponibilità di un servizio web?",
        "svg": ""
      },
      {
        "id": 47,
        "domanda": "Qual è la funzione principale di un server di autenticazione (es. RADIUS, TACACS+)?",
        "svg": ""
      },
      {
        "id": 39,
        "domanda": "Qual è la funzione principale di un sistema di controllo degli accessi (Access Control List - ACL)?",
        "svg": ""
      },
      {
        "id": 20,
        "domanda": "Qual è la funzione principale di un server proxy?",
        "svg": ""
      },
      {
        "id": 42,
        "domanda": "Qual è un protocollo di routing interno (Interior Gateway Protocol - IGP) comunemente utilizzato?",
        "svg": ""
      },
      {
        "id": 6,
        "domanda": "Quale dei seguenti è un dispositivo di rete attivo?",
        "svg": ""
      },
      {
        "id": 9,
        "domanda": "Qual è una responsabilità principale nella gestione degli account utente in un sistema informatico?",
        "svg": ""
      },
      {
        "id": 11,
        "domanda": "Qual è la funzione principale del protocollo DHCP?",
        "svg": ""
      },
      {
        "id": 40,
        "domanda": "Qual è un aspetto cruciale nella pianificazione dell'indirizzamento IP di una rete?",
        "svg": ""
      },
      {
        "id": 13,
        "domanda": "Qual è la funzione principale del protocollo DNS?",
        "svg": ""
      },
      {
        "id": 30,
        "domanda": "Qual è un aspetto importante da considerare nella progettazione di una rete?",
        "svg": ""
      },
      {
        "id": 1,
        "domanda": "Qual è un compito principale di un amministratore di sistema?",
        "svg": ""
      },
      {
        "id": 28,
        "domanda": "Qual è la funzione principale di un sistema operativo server?",
        "svg": ""
      },
      {
        "id": 32,
        "domanda": "Qual è un protocollo di livello applicativo utilizzato per il trasferimento di file?",
        "svg": ""
      }
    ]
  }
]